{
  "chunk-ca25e1b95daef467c64a9046e8200eec": {
    "tokens": 741,
    "content": "Honey never spoils; archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still edible.  \nA day on Venus is longer than a year on Venus.  \nBananas are berries, but strawberries are not.  \nOctopuses have three hearts and blue blood.  \nThe Eiffel Tower can grow taller in the summer due to metal expansion.  \nWater can boil and freeze at the same time in a process called the \"triple point.\"  \nWombat poop is cube-shaped.  \nA group of flamingos is called a \"flamboyance.\"  \nThe inventor of the frisbee was turned into a frisbee after he died.  \nThe shortest war in history was between Britain and Zanzibar in 1896, lasting only 38 to 45 minutes.  \nThere’s a species of jellyfish that is biologically immortal.  \nThe dot over the letter \"i\" is called a \"tittle.\"  \nYou can hear a blue whale’s heartbeat from over two miles away.  \nA bolt of lightning is five times hotter than the surface of the sun.  \nThe unicorn is Scotland’s national animal.  \nCows have best friends and get stressed when they are separated.  \nA group of crows is called a \"murder.\"  \nThe world's largest desert is Antarctica.  \nSome turtles can breathe through their butts.  \nSloths can hold their breath longer than dolphins.  \nThe human body contains enough iron to make a nail.  \nIf you shuffle a deck of cards, it's likely in a sequence that has never existed before.  \nThe smell of freshly-cut grass is actually a plant distress signal.  \nAn octopus' tentacle can operate independently even after being severed.  \nA shrimp’s heart is in its head.  \nThe word \"nerd\" was first coined by Dr. Seuss in \"If I Ran the Zoo.\"  \nA baby puffin is called a \"puffling.\"  \nMosquitoes are the deadliest animals on Earth, responsible for over a million deaths annually.  \nThe average person spends six months of their life waiting for red lights to turn green.  \nIt rains diamonds on Saturn and Jupiter.  \nThe first email was sent in 1971 by Ray Tomlinson.  \nThe world's largest snowflake recorded was 15 inches wide.  \nA cockroach can live for a week without its head.  \nThere’s a town in Norway where the sun doesn’t set for 69 days in the summer.  \nThe oldest known \"your mom\" joke is 3,500 years old and written on a Babylonian tablet.  \nA crocodile can’t stick its tongue out.  \nThere are more fake flamingos in the world than real ones.  \nThe inventor of Pringles was buried in a Pringles can.  \nSpace smells like seared steak and hot metal.  \nSea otters hold hands while sleeping to keep from drifting apart.  \nThere are more stars in the universe than grains of sand on Earth.  \nIf you could fold a piece of paper 42 times, it would reach the Moon.  \nA jellyfish's body is about 95% water.  \nThe word \"emoji\" comes from Japanese, not \"emotion.\"  \nA single spaghetti noodle is called a \"spaghetto.\"  \nPineapples take about two years to grow.  \nThe longest hiccuping spree lasted 68 years.  \nShakespeare invented the words \"gossip,\" \"swagger,\" and \"lonely.\"  \nSquirrels plant thousands of trees every year by forgetting where they buried their acorns.  \nButterflies can taste with their feet.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-ca25e1b95daef467c64a9046e8200eec"
  },
  "chunk-811da763d68ad10db6f29b2e30c32087": {
    "tokens": 88,
    "content": "Financial Planning Overview:\n1. Budgeting is essential for managing personal finances effectively.\n2. Track daily expenses to understand spending patterns.\n3. Set aside 20% of monthly salary for savings.\n4. Create emergency fund covering 6 months of expenses.\n5. Balance between necessary expenses and leisure activities.\n6. Review and adjust budget quarterly.\n7. Use digital tools for expense tracking.\n8. Consider long-term financial goals in planning.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-811da763d68ad10db6f29b2e30c32087"
  }
}